num_month = 0
while 12 < num_month or 1 > num_month:
    num_month = int(input('Введите номер месяца (число от 1 до 12): '))
# ---------------------v1 словарь + список--------------------------
dict_year = {'зима': [12, 1, 2],
             'весна': [3, 4, 5],
             'лето': [6, 7, 8],
             'осень': [9, 10, 11]}

for i in dict_year:
    if num_month in dict_year[i]:
        print(f"Сезон указанного Вами месяца {num_month} - {i}")
        break
# ---------------------v2 только словарь --------------------------
dict_year_v2 = {12: 'зима',
                1: 'зима',
                2: 'зима',
                3: 'весна',
                4: 'весна',
                5: 'весна',
                6: 'лето',
                7: 'лето',
                8: 'лето',
                9: 'осень',
                10: 'осень',
                11: 'осень'}
print(f"Сезон указанного Вами месяца {num_month} - {dict_year_v2[num_month]}")
# ---------------------v3 только списки --------------------------
list_year = [['зима', [12, 1, 2]],
             ['весна', [3, 4, 5]],
             ['лето', [6, 7, 8]],
             ['осень', [9, 10, 11]]
             ]
for i in list_year:
    if num_month in i[1]:
        print(f"Сезон указанного Вами месяца {num_month} - {i[0]}")
        break
